// 1. Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль.
let num = 23
console.log(num)
// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
let a = 10
let b = 2
let c = 5
console.log(a+b+c)
// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
let sum = 100
console.log(sum*2)
// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
let e = 67
console.log(e%7)
// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).
let f = 10
let g = 2
console.log(f+g,f-g,f*g,f/g)
// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result.
let h = 15
let i = 2
result = h+i
console.log(result)
// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c.
let j = 30
let k = 15
l = 30 + 15
console.log(l%4)
// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а результат запишите в переменную result. Выведите в консоль значение переменной result.
let m = 17
let n = 10
let p = 5
o = m-n
result = o+p
console.log(result)
// 9. Вам даны a='10' и b='99'. Сложите переменные a и b и присвойте результат переменной result и выведите её в консоль.
let q = 10
let r = 99
result = q + r
console.log(result)
// 10. Вам даны переменные name='лет', number=10. Сложите данные переменные, присвойте результат переменной result и выведите её в консоль.
let name = "лет"
let number = "10"
result = name+number
console.log(result)